packages/fxa-shared/test/fixtures/stripe/plan1_with_product.json

{
  "id": "plan_GqM9N6qyhvxaVk",
  "object": "plan",
  "active": true,
  "aggregate_usage": null,
  "amount": 500,
  "amount_decimal": "500",
  "billing_scheme": "per_unit",
  "created": 1583259953,
  "currency": "usd",
  "interval": "month",
  "interval_count": 1,
  "livemode": false,
  "metadata": {},
  "nickname": "123Done Pro Monthly",
  "product": {
    "id": "prod_GqM9ToKK62qjkK",
    "object": "product",
    "active": true,
    "attributes": [],
    "created": 1583259938,
    "description": null,
    "images": [],
    "livemode": false,
    "metadata": {
      "capabilities": "testForAllClients, foo",
      "capabilities:dcdb5ae7add825d2": "123donePro,     gogogo",
      "downloadURL": "http://127.0.0.1:8080/",
      "webIconURL": "https://123done-stage.dev.lcip.org/img/transparent-logo.png",
      "webIconBackground": "lime",
      "emailIconURL": "https://123done-stage.dev.lcip.org/img/transparent-logo.png",
      "productSet": "123done",
      "productOrder": "0"
    },
    "name": "123Done Pro",
    "statement_descriptor": null,
    "type": "service",
    "unit_label": null,
    "updated": 1591393664
  },
  "tiers": null,
  "tiers_mode": null,
  "transform_usage": null,
  "trial_period_days": null,
  "usage_type": "licensed"
}
